# Firs NoteBook

In [9]:
import pandas as pd

Criando dicionário

In [85]:
turma = {
    'nome': ['A', 'B', 'C'],
    'p1': [7, 10, 9],
    'p2': [10, 9, 10],
    'presença': [80, 90, 100],
}

## DataFrame

In [86]:
turma_df = pd.DataFrame(turma)
turma_df

  nome  p1  p2  presença
0    A   7  10        80
1    B  10   9        90
2    C   9  10       100

In [87]:
display(turma_df)

  nome  p1  p2  presença
0    A   7  10        80
1    B  10   9        90
2    C   9  10       100

In [43]:
coluna = pd.Series([10, 20, 30])
coluna

0    10
1    20
2    30
dtype: int64

## Lendo e Maipulando Tabelas

In [16]:
df = pd.read_csv('turma.csv')
df

       Nome   Nota   Presença
0  Andressa    7.7         90
1   Beatriz    9.8         99
2     Celso   10.0        100
3     Karla    9.0        100

In [25]:
df_excel = pd.read_excel('Vendas.xlsx', sheet_name='Plan1')
df_excel

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
0,1,2019-01-01,Iguatemi Esplanada,Sapato Estampa,1,358,358
1,1,2019-01-01,Iguatemi Esplanada,Camiseta,2,180,360
2,1,2019-01-01,Iguatemi Esplanada,Sapato Xadrez,1,368,368
3,2,2019-01-02,Norte Shopping,Relógio,3,200,600
4,2,2019-01-02,Norte Shopping,Chinelo Liso,1,71,71
...,...,...,...,...,...,...,...
100994,69996,2019-12-26,Center Shopping Uberlândia,Short Listrado,2,102,204
100995,69996,2019-12-26,Center Shopping Uberlândia,Mochila,4,270,1080
100996,69996,2019-12-26,Center Shopping Uberlândia,Pulseira Estampa,1,87,87
100997,69997,2019-12-26,Ribeirão Shopping,Camisa Listrado,1,108,108
100998,69997,2019-12-26,Ribeirão Shopping,Short Linho,2,133,266

In [37]:
df_excel[['Valor Final']]

        Valor Final
0               358
1               360
2               368
3               600
4                71
...             ...
100994          204
100995         1080
100996           87
100997          108
100998          266

[100999 rows x 1 columns]

In [38]:
df_excel[['ID Loja', 'Quantidade']]

                           ID Loja  Quantidade
0               Iguatemi Esplanada           1
1               Iguatemi Esplanada           2
2               Iguatemi Esplanada           1
3                   Norte Shopping           3
4                   Norte Shopping           1
...                            ...         ...
100994  Center Shopping Uberlândia           2
100995  Center Shopping Uberlândia           4
100996  Center Shopping Uberlândia           1
100997           Ribeirão Shopping           1
100998           Ribeirão Shopping           2

[100999 rows x 2 columns]

Como essa tabela tem escala bem maior podemos usar os comandos a seguir para ler, respectivamente, as 5 primeiras e 5 últimas linhas

In [28]:
df_excel.head()

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
0,1,2019-01-01,Iguatemi Esplanada,Sapato Estampa,1,358,358
1,1,2019-01-01,Iguatemi Esplanada,Camiseta,2,180,360
2,1,2019-01-01,Iguatemi Esplanada,Sapato Xadrez,1,368,368
3,2,2019-01-02,Norte Shopping,Relógio,3,200,600
4,2,2019-01-02,Norte Shopping,Chinelo Liso,1,71,71

In [29]:
df_excel.tail()

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
100994,69996,2019-12-26,Center Shopping Uberlândia,Short Listrado,2,102,204
100995,69996,2019-12-26,Center Shopping Uberlândia,Mochila,4,270,1080
100996,69996,2019-12-26,Center Shopping Uberlândia,Pulseira Estampa,1,87,87
100997,69997,2019-12-26,Ribeirão Shopping,Camisa Listrado,1,108,108
100998,69997,2019-12-26,Ribeirão Shopping,Short Linho,2,133,266

## Filtros

In [24]:
heroes = {
    "Superman": {
        "attack": 95,
        "defense": 98,
        "speed": 90,
        "intelligence": 85
    },
    "Batman": {
        "attack": 70,
        "defense": 80,
        "speed": 75,
        "intelligence": 99
    },
    "Wonder Woman": {
        "attack": 90,
        "defense": 90,
        "speed": 85,
        "intelligence": 80
    },
    "Spider-Man": {
        "attack": 80,
        "defense": 75,
        "speed": 85,
        "intelligence": 88
    },
    "Black Panther": {
        "attack": 82,
        "defense": 78,
        "speed": 83,
        "intelligence": 88
    }
}

df_heroes = pd.DataFrame(heroes)
display(df_heroes)

              Superman  Batman  Wonder Woman  Spider-Man  Black Panther
attack              95      70            90          80             82
defense             98      80            90          75             78
speed               90      75            85          85             83
intelligence        85      99            80          88             88

Nesse exemplo os heróis são colunas e os atributos são linhas, então para filtrar attack > 80, por exemplo, devemos transpor a tabela ou usando:
- **.loc:** acessador de dados por rótulo (label)
- **.column:** atributo que retorna os nomes das colunas do DataFrame (nesse caso, os heróis).

In [26]:
df_heroes.columns

Index(['Superman', 'Batman', 'Wonder Woman', 'Spider-Man', 'Black Panther'], dtype='object')

In [30]:
df_heroes.loc['attack'] > 80

Superman          True
Batman           False
Wonder Woman      True
Spider-Man       False
Black Panther     True
Name: attack, dtype: bool

In [32]:
df_heroes[df_heroes.columns[df_heroes.loc['attack'] > 80]]

              Superman  Wonder Woman  Black Panther
attack              95            90             82
defense             98            90             78
speed               90            85             83
intelligence        85            80             88

Ou pela transposta:

In [34]:
df_heroes.T[df_heroes.T['attack'] > 80]

               attack  defense  speed  intelligence
Superman           95       98     90            85
Wonder Woman       90       90     85            80
Black Panther      82       78     83            88

Combinação de mais de um filtro

In [38]:
filtro_ataque_maior_que_70 = df_heroes.T['attack'] > 70
filtro_inteligencia_maior_que_80 = df_heroes.T['intelligence'] > 80
df_heroes.T[filtro_ataque_maior_que_70 & filtro_inteligencia_maior_que_80]

               attack  defense  speed  intelligence
Superman           95       98     90            85
Spider-Man         80       75     85            88
Black Panther      82       78     83            88

## Criando e removendo colunas

In [88]:
turma_df

  nome  p1  p2  presença
0    A   7  10        80
1    B  10   9        90
2    C   9  10       100

In [89]:
turma_df['media final'] = (turma_df['p1'] + turma_df['p2']) / 2
turma_df

  nome  p1  p2  presença  media final
0    A   7  10        80          8.5
1    B  10   9        90          9.5
2    C   9  10       100          9.5

Removendo uma coluna(axis=1)

In [90]:
turma_df = turma_df.drop('media final', axis=1)
turma_df

  nome  p1  p2  presença
0    A   7  10        80
1    B  10   9        90
2    C   9  10       100

Incrementando DataFrame

Usando o .concat que empilha as tabelas, mas é possível também cruzar informações e combinar dados.

In [ ]:
novo = pd.DataFrame([{
    'nome': 'D',
    'p1': 7,
    'p2': 10,
    'presença': 100
}])
turma_df = pd.concat([turma_df, novo])
turma_df

  nome  p1  p2  presença
0    B  10   9        90
1    C   9  10       100
2    D   7  10       100
3    A   7  10        80

## Explorando dados

- **df.info():** resumo da estrutura do DataFrame.
- **df.describe():** estatísticas descritivas para colunas numéricas (por padrão).
- **df.sum():** soma dos valores por coluna (padrão) ou por linha (axis=1).
- **df.mean():** média aritmética dos valores.

In [49]:
turma_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nome      3 non-null      object
 1   p1        3 non-null      int64
 2   p2        3 non-null      int64
 3   presença  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [50]:
turma_df.describe()

              p1         p2  presença
count   3.000000   3.000000       3.0
mean    8.666667   9.666667      90.0
std     1.527525   0.577350      10.0
min     7.000000   9.000000      80.0
25%     8.000000   9.500000      85.0
50%     9.000000  10.000000      90.0
75%     9.500000  10.000000      95.0
max    10.000000  10.000000     100.0

OBS: count (quantos dados tem), mean (média), std (desvio padrão), min (mínimo), 5%, 50% (mediana), 75% (quartis), max (máximo).

In [66]:
turma_df.sum()

nome         ABCD
p1             33
p2             39
presença    270.0
presenca    100.0
dtype: object

In [67]:
turma_df['p1'].sum()

np.int64(33)

In [68]:
turma_df['p1'].mean()

np.float64(8.25)

## Limpeza de dados

- isnull(): verificar dados faltando (NaN)
- dropna(): remover dados faltantes

In [69]:
turma_df.dropna(axis=1)           # remove colunas com qualquer NaN
turma_df.dropna(thresh=3)         # mantém linhas com pelo menos 3 valores não nulos

  nome  p1  p2  presença  presenca
0    A   7  10      80.0       NaN
1    B  10   9      90.0       NaN
2    C   9  10     100.0       NaN
0    D   7  10       NaN     100.0

- fillna(0): preencher dados faltantes, atributo 0(preenche com 0), atributo('desconhecido') preenche com desconhecido.
- duplicated(): remover dados duplicados. no exemplo, retorna True para linhas duplicadas
    - df.drop_duplicates():remove duplicadas
- rename(): altera nome das colunas

## Contando ocorrências

In [75]:
turma_df['presença'].value_counts()

presença
80.0     1
90.0     1
100.0    1
Name: count, dtype: int64

## Ordenando Dados

In [109]:
turma_df = turma_df.sort_values(by='p1')
turma_df

  nome  p1  p2  presença
0    A   7  10        80
0    D   7  10       100
2    C   9  10       100
1    B  10   9        90

In [110]:
turma_df = turma_df.sort_values(by='p1', ascending=False)
turma_df

  nome  p1  p2  presença
1    B  10   9        90
2    C   9  10       100
0    D   7  10       100
0    A   7  10        80

## Escrevendo em arquivos

In [114]:
turma_df = turma_df.sort_values('nome')
turma_df.to_csv('turma.csv')